# Weight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..Weight Property
FabricationPart Class See Also
---
The weight of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double Weight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Weight As Double
	Get
```

Visual C++
---
```text
public:
property double Weight {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace